app/controllers/boards_controller.rb

SELECT DISTINCT `boards`.* FROM `boards` ORDER BY `boards`.`created_at` DESC LIMIT 20 OFFSET 0
---
  def index
    @q = Board.ransack(params[:q])
    @boards = @q.result(distinct: true).includes(:user).order(created_at: :desc).page(params[:page])

INSERT INTO `boards` (`user_id`, `title`, `body`, `created_at`, `updated_at`, `board_image`) VALUES (1, 'test', 'test', '2024-04-17 08:34:21.947500', '2024-04-17 08:34:21.947500', 'FCwSil9XsAEGGe7.jpeg')
---
  def create
    @board = current_user.boards.build(board_params)
    if @board.save

SELECT DISTINCT `boards`.* FROM `boards` INNER JOIN `bookmarks` ON `boards`.`id` = `bookmarks`.`board_id` WHERE `bookmarks`.`user_id` = 1 ORDER BY `boards`.`created_at` DESC LIMIT 20 OFFSET 0
---
  def bookmarks
    @q = current_user.bookmark_boards.ransack(params[:q])
    @bookmark_boards = @q.result(distinct: true).includes(:user).order(created_at: :desc).page(params[:page])