app/controllers/users_controller.rb

INSERT INTO `users` (`last_name`, `first_name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `avatar`) VALUES ('花山', '薫', 'hanayama@hana.jp', '$2a$10$OUaOh2tKfGz7h9CKTsHiQ.D6YqajIG6W15WuqXHfoAqyge6w2Zcti', 'cxQzSJm9g21yLjdV2-Az', '2024-04-15 09:47:12.780615', '2024-04-15 09:47:12.780615', NULL)
---
  def create
    @user = User.new(user_params)
    if @user.save